# Introduction to Pandas

Complete the following set of exercises to solidify your knowledge of Pandas fundamentals.

#### 1. Import Numpy and Pandas and alias them to `np` and `pd` respectively.

In [1]:
# your code here
import numpy as np
import pandas as pd

## Challenge 1

#### 2. Create a Numpy array, a Pandas Series and a Pandas DataFrame containing the elements of the list below.

In [2]:
lst = [5.7, 75.2, 74.4, 84.0, 66.5, 66.3, 55.8, 75.7, 29.1, 43.7]

In [3]:
# your code here
a = np.array(lst)
print(a)
print(a.shape)

[ 5.7 75.2 74.4 84.  66.5 66.3 55.8 75.7 29.1 43.7]
(10,)

In [4]:
s = pd.Series(lst)
print(s)

0     5.7
1    75.2
2    74.4
3    84.0
4    66.5
5    66.3
6    55.8
7    75.7
8    29.1
9    43.7
dtype: float64

In [5]:
df_s = pd.DataFrame(lst)
print(df_s)

      0
0   5.7
1  75.2
2  74.4
3  84.0
4  66.5
5  66.3
6  55.8
7  75.7
8  29.1
9  43.7

#### 3. Use indexing to return the third value in the array/Series/DataFrame above.
*Hint: Remember that indexing begins at 0.*

In [6]:
# your code here
print(a[2,])
print(a[2])
print(s[2])
print(df_s.iloc[2,0])

74.4
74.4
74.4
74.4

#### 4. Create a Pandas DataFrame from the list of lists below. Each sublist should be represented as a row.

In [7]:
b = [[53.1, 95.0, 67.5, 35.0, 78.4],
     [61.3, 40.8, 30.8, 37.8, 87.6],
     [20.6, 73.2, 44.2, 14.6, 91.8],
     [57.4, 0.1, 96.1, 4.2, 69.5],
     [83.6, 20.5, 85.4, 22.8, 35.9],
     [49.0, 69.0, 0.1, 31.8, 89.1],
     [23.3, 40.7, 95.0, 83.8, 26.9],
     [27.6, 26.4, 53.8, 88.8, 68.5],
     [96.6, 96.4, 53.4, 72.4, 50.1],
     [73.7, 39.0, 43.2, 81.6, 34.7]]

# your code here
b_df = pd.DataFrame(b)
b_df

      0     1     2     3     4
0  53.1  95.0  67.5  35.0  78.4
1  61.3  40.8  30.8  37.8  87.6
2  20.6  73.2  44.2  14.6  91.8
3  57.4   0.1  96.1   4.2  69.5
4  83.6  20.5  85.4  22.8  35.9
5  49.0  69.0   0.1  31.8  89.1
6  23.3  40.7  95.0  83.8  26.9
7  27.6  26.4  53.8  88.8  68.5
8  96.6  96.4  53.4  72.4  50.1
9  73.7  39.0  43.2  81.6  34.7

In [8]:
print(b_df.shape)
print(b_df.size)
print(len(b_df))

(10, 5)
50
10

#### 4bis. Use indexing to return column 1.
*Hint: Remember that indexing begins at 0.*

In [9]:
b_df[0]

0    53.1
1    61.3
2    20.6
3    57.4
4    83.6
5    49.0
6    23.3
7    27.6
8    96.6
9    73.7
Name: 0, dtype: float64

In [10]:
b_df.iloc[:,0]

0    53.1
1    61.3
2    20.6
3    57.4
4    83.6
5    49.0
6    23.3
7    27.6
8    96.6
9    73.7
Name: 0, dtype: float64

In [11]:
b_df.loc[:,0]

0    53.1
1    61.3
2    20.6
3    57.4
4    83.6
5    49.0
6    23.3
7    27.6
8    96.6
9    73.7
Name: 0, dtype: float64

#### 4bis. Use indexing to return line 1.
*Hint: Remember that indexing begins at 0.*

In [12]:
b_df.iloc[0]

0    53.1
1    95.0
2    67.5
3    35.0
4    78.4
Name: 0, dtype: float64

In [13]:
b_df.iloc[0,]

0    53.1
1    95.0
2    67.5
3    35.0
4    78.4
Name: 0, dtype: float64

In [14]:
b_df.iloc[0,:]

0    53.1
1    95.0
2    67.5
3    35.0
4    78.4
Name: 0, dtype: float64

In [15]:
b_df.loc[0]

0    53.1
1    95.0
2    67.5
3    35.0
4    78.4
Name: 0, dtype: float64

In [16]:
b_df.loc[0,]

0    53.1
1    95.0
2    67.5
3    35.0
4    78.4
Name: 0, dtype: float64

In [17]:
b_df.loc[0,:]

0    53.1
1    95.0
2    67.5
3    35.0
4    78.4
Name: 0, dtype: float64

#### 5. Rename the data frame columns based on the names in the list below.

In [18]:
colnames = ['Score_1', 'Score_2', 'Score_3', 'Score_4', 'Score 5']
# your code here
df = b_df.copy()
df.columns = colnames
df

   Score_1  Score_2  Score_3  Score_4  Score 5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

#### 5bis. Rename the "Score 5" column as "Score_5".

In [19]:
# your code here
df.rename(columns={'Score 5':'Score_5'}, inplace=True)
df

   Score_1  Score_2  Score_3  Score_4  Score_5
0     53.1     95.0     67.5     35.0     78.4
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
3     57.4      0.1     96.1      4.2     69.5
4     83.6     20.5     85.4     22.8     35.9
5     49.0     69.0      0.1     31.8     89.1
6     23.3     40.7     95.0     83.8     26.9
7     27.6     26.4     53.8     88.8     68.5
8     96.6     96.4     53.4     72.4     50.1
9     73.7     39.0     43.2     81.6     34.7

#### 6. Use indexing to return the 0.1 value in df above.
*Hint: Remember that indexing begins at 0.*

In [20]:
print(df.iloc[3,1])
print(df.loc[3,'Score_2'])
print(df['Score_2'][3])

0.1
0.1
0.1

In [21]:
print(df['Score_1'])
print(df.loc[:,'Score_1'])
print(df.iloc[:,0])

0    53.1
1    61.3
2    20.6
3    57.4
4    83.6
5    49.0
6    23.3
7    27.6
8    96.6
9    73.7
Name: Score_1, dtype: float64
0    53.1
1    61.3
2    20.6
3    57.4
4    83.6
5    49.0
6    23.3
7    27.6
8    96.6
9    73.7
Name: Score_1, dtype: float64
0    53.1
1    61.3
2    20.6
3    57.4
4    83.6
5    49.0
6    23.3
7    27.6
8    96.6
9    73.7
Name: Score_1, dtype: float64

In [22]:
print(df[1:3])

   Score_1  Score_2  Score_3  Score_4  Score_5
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8

In [23]:
print(df.iloc[1:3])
print(df.iloc[1:3,:3])
print(df.iloc[[1,3],[1,3]])

   Score_1  Score_2  Score_3  Score_4  Score_5
1     61.3     40.8     30.8     37.8     87.6
2     20.6     73.2     44.2     14.6     91.8
   Score_1  Score_2  Score_3
1     61.3     40.8     30.8
2     20.6     73.2     44.2
   Score_2  Score_4
1     40.8     37.8
3      0.1      4.2

#### 7. From the original data frame, calculate the average Score_3 value.

In [24]:
# your code here
df['Score_3'].mean()

56.95000000000001

#### 8. From the original data frame, calculate the maximum Score_4 value.

In [25]:
# your code here
df['Score_4'].max()

88.8

#### 9. From the original data frame, calculate the median Score 2 value.

In [26]:
# your code here
df['Score_2'].median()

40.75

#### 10. Create a subset of df that contains only the Score 1, 3, and 5 columns.

In [27]:
# your code here
sub_df = df[['Score_1','Score_3', 'Score_5']]
sub_df

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
1     61.3     30.8     87.6
2     20.6     44.2     91.8
3     57.4     96.1     69.5
4     83.6     85.4     35.9
5     49.0      0.1     89.1
6     23.3     95.0     26.9
7     27.6     53.8     68.5
8     96.6     53.4     50.1
9     73.7     43.2     34.7

#### 10bis. Create a subset of df that contains only the Score 3 to 5 columns.

In [28]:
# your code here
sub_df = df.loc[:,'Score_3':'Score_5']
sub_df

   Score_3  Score_4  Score_5
0     67.5     35.0     78.4
1     30.8     37.8     87.6
2     44.2     14.6     91.8
3     96.1      4.2     69.5
4     85.4     22.8     35.9
5      0.1     31.8     89.1
6     95.0     83.8     26.9
7     53.8     88.8     68.5
8     53.4     72.4     50.1
9     43.2     81.6     34.7

#### 10ter. Create a subset of df that contains only the Score 1, 3, and 5 columns and rows indexed 0 and 3.

In [29]:
# your code here
subdf2 = df.loc[[0,3],['Score_1','Score_3', 'Score_5']]
subdf2

   Score_1  Score_3  Score_5
0     53.1     67.5     78.4
3     57.4     96.1     69.5

## Challenge 2

#### 1. Create a Pandas DataFrame from the dictionary of product orders below.

In [30]:
orders = {'Description': ['LUNCH BAG APPLE DESIGN',
  'SET OF 60 VINTAGE LEAF CAKE CASES ',
  'RIBBON REEL STRIPES DESIGN ',
  'WORLD WAR 2 GLIDERS ASSTD DESIGNS',
  'PLAYING CARDS JUBILEE UNION JACK',
  'POPCORN HOLDER',
  'BOX OF VINTAGE ALPHABET BLOCKS',
  'PARTY BUNTING',
  'JAZZ HEARTS ADDRESS BOOK',
  'SET OF 4 SANTA PLACE SETTINGS'],
 'Quantity': [1, 24, 2, 288, 2, 7, 1, 2, 1, 2],
 'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 1.65, 4.95, 0.19, 1.25],
 'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

# your code here
dictdf = pd.DataFrame(orders)
dictdf

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          2       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS       288       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1       1.65    11.95
7                       PARTY BUNTING         2       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK         1       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS         2       1.25    60.00

#### 2. Sum up revenue by number of items sold.

In [31]:
df_revenue = dictdf.groupby('Quantity').agg({'Revenue':'sum'})
df_revenue

          Revenue
Quantity
1           15.50
2           83.95
7            5.95
24          13.20
288        518.40

#### 3. Transpose the df under a new name, and calculate the total quantity ordered and revenue generated from these orders.

In [32]:
### your code here
newdictdf = dictdf.copy().T
print(newdictdf)

                                  0                                   1  \
Description  LUNCH BAG APPLE DESIGN  SET OF 60 VINTAGE LEAF CAKE CASES
Quantity                          1                                  24
UnitPrice                      1.65                                0.55
Revenue                        1.65                                13.2

                                       2                                  3  \
Description  RIBBON REEL STRIPES DESIGN   WORLD WAR 2 GLIDERS ASSTD DESIGNS
Quantity                               2                                288
UnitPrice                           1.65                               0.18
Revenue                             1.65                              518.4

                                            4               5  \
Description  PLAYING CARDS JUBILEE UNION JACK  POPCORN HOLDER
Quantity                                    2               7
UnitPrice                                1.25            0.85
Revenue                                   2.5            5.95

                                          6              7  \
Description  BOX OF VINTAGE ALPHABET BLOCKS  PARTY BUNTING
Quantity                                  1              2
UnitPrice                              1.65           4.95
Revenue                               11.95           19.8

                                    8                              9
Description  JAZZ HEARTS ADDRESS BOOK  SET OF 4 SANTA PLACE SETTINGS
Quantity                            1                              2
UnitPrice                        0.19                           1.25
Revenue                           1.9                             60

In [33]:
### your code here

print("Total Quantity Ordered =", dictdf['Quantity'].sum())
print("Total Revenue =", dictdf['Revenue'].sum())

Total Quantity Ordered = 330
Total Revenue = 637.0

#### 4. Obtain the prices of the most expensive and least expensive items ordered and print the difference.

In [34]:
# your code here
print("Most expensive item:", dictdf["UnitPrice"].max())
print("Least expensive item;", dictdf["UnitPrice"].min())
print("Price gap:", dictdf["UnitPrice"].max() - dictdf["UnitPrice"].min())

Most expensive item: 4.95
Least expensive item; 0.18
Price gap: 4.7700000000000005

In [35]:
dictdf["Quantity"].value_counts()

2      4
1      3
24     1
7      1
288    1
Name: Quantity, dtype: int64

In [36]:
dictdf["Quantity"].count()

10

In [37]:
dictdf["Quantity"].quantile()
# par défaut, médiane

2.0

In [38]:
dictdf.quantile(.75)

Quantity      5.75
UnitPrice     1.65
Revenue      18.15
Name: 0.75, dtype: float64

In [39]:
dictdf["Quantity"].quantile(.75)

5.75

In [40]:
dictdf['UnitPrice'].mode()

0    1.65
dtype: float64

In [45]:
df_final = pd.DataFrame()
df_final=df_final.append(dictdf)
df_final=df_final.append(dictdf)
df_final

                          Description  Quantity  UnitPrice  Revenue
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          2       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS       288       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1       1.65    11.95
7                       PARTY BUNTING         2       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK         1       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS         2       1.25    60.00
0              LUNCH BAG APPLE DESIGN         1       1.65     1.65
1  SET OF 60 VINTAGE LEAF CAKE CASES         24       0.55    13.20
2         RIBBON REEL STRIPES DESIGN          2       1.65     1.65
3   WORLD WAR 2 GLIDERS ASSTD DESIGNS       288       0.18   518.40
4    PLAYING CARDS JUBILEE UNION JACK         2       1.25     2.50
5                      POPCORN HOLDER         7       0.85     5.95
6      BOX OF VINTAGE ALPHABET BLOCKS         1       1.65    11.95
7                       PARTY BUNTING         2       4.95    19.80
8            JAZZ HEARTS ADDRESS BOOK         1       0.19     1.90
9       SET OF 4 SANTA PLACE SETTINGS         2       1.25    60.00